<?php
// +----------------------------------------------------------------------
// | ThinkCMF [ WE CAN DO IT MORE SIMPLE ]
// +----------------------------------------------------------------------
// | Copyright (c) 2013-2018 http://www.thinkcmf.com All rights reserved.
// +----------------------------------------------------------------------
// | Author: Dean <zxxjjforever@163.com>
// +----------------------------------------------------------------------
return [
    
    'viewtype'        => [
        'title'   => '内容显示类型',
        'type'    => 'radio',
        'options' => [
            '1' => '显示全部上传文件',
            '2' => '按上传按钮类型显示同类型文件'
        ],
        'value'   => 2,
        'tip'     => '控制显示内容'      
    ],
    'border'        => [
        'title' => '边框宽度',
        'type'  => 'number',
        'value' => '2',
        'tip'   => '单位:象素'
    ],
    'color'         => [
        'title' => '选中边框颜色',
        'type'  => 'color',
        'value' => '#ff0000',
        'tip'   => '选中图片的边框颜色'
    ],
    'image'         => [
        'title' => '图片',
        'type'  => 'image',
        'value' => '',
        'tip'   => '这是图片组件的演示'
    ],
    'file'          => [
        'title' => '文件',
        'type'  => 'file',
        'value' => '',
        'tip'   => '这是文件组件的演示'
    ],
    
];
					