<?php
// +----------------------------------------------------------------------
// | TcLinksubmit [ WE CAN DO IT MORE SIMPLE ]
// +----------------------------------------------------------------------
// | Copyright (c) 2017 Tangchao All rights reserved.
// +----------------------------------------------------------------------
// | Author: Tangchao <79300975@qq.com>
// +----------------------------------------------------------------------
return [
    'linksubmit'     => [
        'title' => '接口调用地址',
        'type'  => 'text',
        'value' => 'http://data.zz.baidu.com/urls?site=https://www.*****.com&token=*******',
        'tip'   => ''
    ]
];